[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"GameJsonCfg",{"PrivacyCfg2":[{"content":"Effective Date: May 18, 2023"},{"content":"User feedback gathered at: lukaichun@gdsftoys.com"},{"content":"This User Registration Service Agreement (hereinafter referred to as "this Agreement") is an agreement between you (hereinafter referred to as "User") and Shifeng (Shenzhen) Network Technology Co., Ltd. (hereinafter referred to as "Shifeng") regarding the products and services provided by Shifeng on its and/or its affiliated companies' web game platforms (including Shifeng's website and the game services and other network services that Shifeng is currently providing and may provide to Users in the future, collectively referred to as "Products and Services")."},{"content":"If the user enters the user registration page of the Shifeng website or its games, confirms that they have read, agreed to the terms of this agreement and completed the registration, or obtains and uses the products and services provided by Shifeng through any other means, it shall be deemed that the user has carefully read the content of this agreement and agrees to abide by the provisions of this agreement. Users should no longer refuse to perform this agreement on the grounds of not understanding the content of this agreement. Therefore, users must carefully read and fully understand the contents of each clause, especially the clauses that exempt or limit liability, jurisdiction and legal application clauses, as well as separate agreements for opening or using a certain service. We remind users to pay special attention to the content of restrictions, disclaimers, and other terms that require users to read carefully in bold. In addition, according to Article 16 of this Agreement, Shifeng has the right to modify and update this Agreement from time to time. Users are advised to pay attention to the latest version of this Agreement."},{"content":"1、 Service Content"},{"content":"1. The specific content of Shifeng's products and services will be provided by Shifeng according to the actual situation, such as online games, forums (BBS), chat rooms, emails, etc. Shifeng reserves the right to change, interrupt or terminate some or all of its products and services at any time."},{"content":"2. Shifeng may charge certain fees to some users when providing products and services. In this case, there will be clear prompts on the relevant pages. If the user does not agree to pay such fees, they may choose not to accept the corresponding products and services."},{"content":"3. Shifeng provides users with products and services through server side equipment accessing the Internet. In addition, the equipment related to products and services (such as computers, modems and other devices related to Internet access) and the required fees (such as telephone fees and Internet access fees paid for Internet access) shall be borne by users themselves."},{"content":"4. Users should use genuine software to receive products and services, and the software fees should be borne by the users themselves."},{"content":"2、 Account name and password"},{"content":"1. The user reads and agrees to this agreement, and upon successful registration, becomes a registered user of Shifeng and obtains a Shifeng user account (hereinafter referred to as the "Shifeng Account"). The account name of Shifeng cannot be changed after registration, while the password corresponding to the account can be modified through the customer service provided by Shifeng."},{"content":"2. The user is fully responsible for the safekeeping of the Shifeng account and password, as well as all actions taken using the account and password. It is prohibited to sell, transfer, lend, or share the Shifeng account or password with others for use. Due to the user's negligence in storage or any third-party behavior, if the user's Shifeng account or password is illegally used by others, and any consequences arising therefrom, Shifeng shall not be held responsible."},{"content":"3. If a user discovers that their Feng account or password has been illegally used or has abnormal usage, they should promptly notify Feng according to the handling methods announced by Feng from time to time, and have the right to request Feng to take measures to suspend the login and use of the account. Shifeng decides whether to suspend user account login and usage based on the verification results of user identity."},{"content":"3、 Account registration information"},{"content":"1. Provide registration information"},{"content":"(1) When applying for a Shifeng account (or supplementing information after registration), users should provide Shifeng with the latest, detailed, and accurate personal registration information. The aforementioned personal registration information includes: the user's Shifeng account name, password, and all information entered for registering a Shifeng account (or supplementing or updating account information). The user hereby undertakes to register as a user of Shifeng with their true identity, and guarantees that the personal identity information provided is true, complete, and valid. They shall bear corresponding legal responsibilities for the information provided in accordance with legal provisions and necessary terms. Shifeng should provide users with necessary assistance and support such as proof of account registration, original registration information, and provide relevant evidence and information to relevant administrative and judicial authorities as needed."},{"content":"(2) All personal registration information provided by users may be used by Shifeng as a basis for determining the association of Shifeng accounts and identifying user identities. The user agrees to provide proof of such information at any time as requested by Shifeng, in order for Shifeng to verify the user's identity."},{"content":"(3) If the information provided by the user to Shifeng is inaccurate, untrue, illegal, invalid, has been changed but not updated in a timely manner, or has any misleading suspicion, Shifeng has the right to suspend or terminate the user's use of any Shifeng services until the user provides satisfactory information. Shifeng shall notify users and inform them of the suspension period when taking suspension measures. The suspension period should be reasonable, and Shifeng shall promptly resume services to users upon expiration of the suspension period."},{"content":"(4) Shifeng has the right to review whether the identity information provided by user registration is true and valid, and should actively take reasonable measures such as technology and management to ensure the security and effectiveness of user accounts; Users have the obligation to properly safeguard their accounts and passwords, and use them correctly and securely. If either party fails to fulfill the above obligations and causes damage to the rights of the other party or others due to the loss of account passwords, theft of accounts, etc., they shall bear the legal responsibility arising therefrom."},{"content":"2. Search for registration information"},{"content":"Users have the right to access and view their registration information and personal information at any time by logging into the official website of Shifeng and accessing the "User Center" page."},{"content":"3. Modify registration information"},{"content":"Users have the right to update or modify the information provided when applying for registration at any time by logging into the official website of Shifeng, on the "User Center" page, or through other channels published by Shifeng. Shifeng should provide this service promptly and effectively. However, the real name, ID number, and the name of the Shifeng account that users fill in when registering (or supplementing information after registration) cannot be modified without special reasons after successful account registration (or supplementing information). Users are advised to carefully fill in all types of registration information."},{"content":"4. The user agrees that all information, data, and records related to their Fengfeng account (including but not limited to login records, post login behavior records, point card information, etc.) shall be based on the data recorded by the Fengfeng system."},{"content":"4、 Information Disclosure and Protection"},{"content":"The registration information described in Article 3 of this Agreement, as well as non-public information stored by users within the control of Shifeng when using products and services (hereinafter referred to as "user information"), shall be disclosed and protected in accordance with the provisions of this Article."},{"content":"In order to provide users with better products and services, if users voluntarily choose to use Shifeng's products and services, or expressly agree to provide information, Shifeng may collect user information and may analyze and integrate this information. When users use Shifeng's products and services, the server may automatically record some user information, which will become part of Shifeng's trade secrets."},{"content":"Protecting the privacy of users, especially underage users, is a fundamental principle of Shifeng. Shifeng has always actively taken reasonable measures in technology and management to ensure the security and confidentiality of user information."},{"content":"4. Except for the four situations listed in Article 4, Paragraph 4 of this Agreement, Shifeng guarantees not to disclose or provide user information to the public or to third parties. The four exceptions are as follows:"},{"content":"(1) The user (or the user's guardian) requests or agrees to Shifeng disclosing user information;"},{"content":"(2) Relevant laws and regulations require Shifeng to disclose user information;"},{"content":"(3) Judicial or administrative authorities require Shifeng to disclose user information based on legal procedures;"},{"content":"(4) When filing a lawsuit or arbitration against users to protect the legitimate rights and interests (intellectual property and other rights) of Shifeng, it is necessary to disclose user information;"},{"content":"5. In order to provide products and services to users normally, Shifeng may need to transmit some user information to Shifeng's technical service providers, Shifeng's affiliated companies, or other third parties. On the premise that these third parties promise to assume at least the same confidentiality obligations as Shifeng, Shifeng will transmit user information to these third parties, and users understand and agree to this."},{"content":"6. Without disclosing individual user privacy information, Shifeng has the right to conduct technical analysis on the entire user information database and commercially utilize the analyzed and organized user database."},{"content":"7. Shifeng will take commercially reasonable and feasible measures to protect the security of users' personal information. Shifeng uses commonly available security technologies and procedures to protect users' personal information from unauthorized access, use, or disclosure."},{"content":"5、 Basic rights of users"},{"content":"1. Users may use the products and services provided by Shifeng in accordance with this agreement and other rules published and changed by Shifeng from time to time."},{"content":"2. Users can voluntarily choose to bind the pages provided by Shifeng through their mobile phones, in order to obtain the game activities, discount information, and other content provided by Shifeng in the first time."},{"content":"3. Users have the right to supervise whether Shifeng and its staff provide products and services to users in accordance with the standards published by Shifeng during the use of the products and services provided by Shifeng, and may also provide opinions and suggestions related to the products and services to Shifeng at any time."},{"content":"4. If the user does not agree with the terms of this agreement, or has objections to the later modified or updated terms of Shifeng, or is dissatisfied with the products and services provided by Shifeng, the user may choose to stop using Shifeng's products and services at any time. If the user chooses to stop using Shifeng's products and services, Shifeng will no longer assume any obligations or responsibilities towards the user."},{"content":"6、 User Code of Conduct"},{"content":"1. The user agrees to regulate their behavior in accordance with various rules published or changed by Shifeng from time to time, including this agreement, in order to accept and use Shifeng's products and services. Users have the right and are responsible for any actions that occur after logging into their account in accordance with the law. The user further agrees that in the event of a violation of these rules, they shall bear the consequences of the violation and breach of contract liability in accordance with the provisions of Article 6, paragraphs 14, 15, 14, and other relevant provisions of this Agreement."},{"content":"2. During the use of Shifeng account, the user must abide by the laws and regulations related to Internet information release and the generally applicable norms of Internet general ethics and etiquette, and the user will bear the responsibility for the information content released by the user. All types of information posted by users shall not include the following content:"},{"content":"(1) Violating the basic principles established by the Constitution;"},{"content":"(2) Endangering national security, leaking state secrets, subverting state power, and undermining national unity;"},{"content":"(3) Damaging national honor and interests;"},{"content":"(4) Those who incite ethnic hatred, ethnic discrimination, and undermine ethnic unity;"},{"content":"(5) Disrupting national religious policies, promoting cults and feudal superstitions;"},{"content":"(6) Spreading rumors, disrupting social order, and disrupting social stability;"},{"content":"(7) Spreading obscene, pornographic, gambling, violent, murderous, terrorist information or inciting crime;"},{"content":"(8) Insult, defame, or maliciously use language to attack others, infringing on their legitimate rights and interests;"},{"content":"(9) Infringement of any third party's intellectual property, copyright, or public/private rights;"},{"content":"(10) Violating humanistic morality, customs and habits;"},{"content":"(11) Disrupting the normal order of the game;"},{"content":"(12) Containing other content prohibited by laws and administrative regulations."},{"content":"3. The user's account name and the names of characters, gangs, etc. in the game should comply with the principles of legality and health. It is not allowed to use names that involve but are not limited to race, religion, politics, national leaders, obscenity, vulgarity, defamation, intimidation, fraud, aggression, insult, may cause misunderstandings, prohibited drugs, and other content."},{"content":"4. Users should be responsible for their words and actions in the game, especially not:"},{"content":"(1) Spreading or disseminating vulgar or indecent information through any means or behavior;"},{"content":"(2) Spreading or disseminating false information to other users by impersonating the platform or game system through any means or behavior;"},{"content":"(3) Causing disputes through any means or channels;"},{"content":"(4) Spreading or disseminating, using private servers, trojans, cheats, viruses, and such information through any means or behavior;"},{"content":"(5) Spreading or disseminating training information through any means or behavior;"},{"content":"(6) Spread or conduct offline transactions of game accounts, virtual currencies, and virtual props through any means or behavior other than the trading channels provided by Shifeng;"},{"content":"(7) Spread a large amount of identical or similar phrases or meaningless words, or any information unrelated to the Shifeng platform and its games;"},{"content":"(8) Promote and incite any violent behavior outside the virtual world of the game;"},{"content":"(9) Disclosing any game world and real-world information of other users, non users, or employees of the Shifeng platform;"},{"content":"(10) Promote or publish illegal information, information that violates social ethics, or information that is detrimental to the construction of spiritual civilization, including but not limited to pornography, gambling, cults, terrorism, and other content;"},{"content":"(11) Spread any kind of advertising information and advertising links through any means or behavior;"},{"content":"(12) Posting defamatory or attacking comments or information about Shifeng;"},{"content":"(13) Other statements or behaviors that do not comply with laws, regulations, social ethics, or game rules."},{"content":"5. Users shall not interfere with or obstruct the normal provision of products and services by Shifeng, especially not:"},{"content":"(1) Attack, invade or overload the website servers of Shifeng;"},{"content":"(2) Crack and modify the client program provided by Shifeng;"},{"content":"(3) Attacking, infiltrating or overloading game servers or game server-side programs of Shifeng;"},{"content":"(4) Unreasonable interference or obstruction of others' use of the products and services provided by Shifeng;"},{"content":"(5) Exploiting program vulnerabilities and bugs to disrupt the normal functioning of the game or propagate such vulnerabilities or bugs;"},{"content":"(6) Directly or indirectly exploiting game bugs (including vulnerabilities or unreasonable phenomena in game systems, programs, settings, etc.), program vulnerabilities for profit or disrupting game order, or using bugs or vulnerabilities to achieve personal goals;"},{"content":"(7) Produce, use, publish, and disseminate any form of auxiliary tools or programs that hinder game fairness (referring to any files or programs used to gain advantages in the game, but not part of the Shifeng platform or various game software), including cheating cheats and related auxiliary cheats (including but not limited to automatic monster fighting, automatic leveling, automatic medication, automatic task completion, acceleration, or operations beyond the game's set scope);"},{"content":"(8) It is not allowed to modify the client program to change, add or reduce the pre-set functions of the Shifeng platform, or to cause any abnormal behavior in the data sent by the client to the server."},{"content":"6. Users are not allowed to disrupt the game order, especially not to:"},{"content":"(1) Staying in special locations or sensitive areas for a long time (including but not limited to event registrants, "immigration ambassadors," teleporters, teleportation points, etc.), interfering with other users' games;"},{"content":"(2) Engaging in malicious PK, win, extortion, blackmail and other behaviors;"},{"content":"(3) Threatening or inciting other users or non users to participate in abnormal game content (including but not limited to parades, gatherings, etc.);"},{"content":"(4) Using characters with similar nicknames to impersonate friends, NPCs, or official characters to commit fraud both inside and outside the game."},{"content":"7. Users can communicate with the game administrator (hereinafter referred to as "GM"), but when communicating with the GM, they must not engage in the following behaviors:"},{"content":"(1) Impersonate the system or GM;"},{"content":"(2) Deceiving or attempting to deceive GM, including but not limited to misleading GM, refusing to provide information, providing false information, and any attempt to 'defraud' GM;"},{"content":"(3) Violating or ignoring the prompts given by GM. In the game, in order to ensure the common interests of the majority of users and maintain normal game order, GM may prompt users to perform certain operations or stop performing certain operations, and users must not ignore or obstruct the progress of this work;"},{"content":"(4) Interference with GM operations. Disrupting GM's work includes but is not limited to: requesting any game virtual items (including but not limited to virtual currency, game props, etc.) from GM, frequently calling GM or sending requests without substantive content, repeatedly sending assistance requests to GM that have been answered or resolved;"},{"content":"(5) Insult, threaten, or maliciously attack GM."},{"content":"8. Users must keep their accounts and passwords safe. Any consequences caused by the leakage of accounts and passwords due to the user's own reasons will be borne by the user."},{"content":"9. Users can only use the products and services provided by Shifeng in their personal capacity. Users cannot use Shifeng's products and services for commercial purposes, nor can they use Shifeng's products and services for sales or other commercial purposes."},{"content":"10. Unless obtaining written permission from Shifeng, users are not allowed to use any of Shifeng's products, services, or any of its content for commercial gain, including but not limited to acting as intermediaries for game props trading and collecting intermediary fees, or selling game props for profit."},{"content":"11. Users are not allowed to use the products and services provided by Shifeng to engage in the following activities:"},{"content":"(1) Without permission, entering the Shifeng computer information network system or using computer information network system resources;"},{"content":"(2) Unauthorized deletion, modification, or addition of computer information network functions;"},{"content":"(3) Unauthorized deletion, modification, or addition of data and applications stored, processed, or transmitted in computer information networks;"},{"content":"(4) Intentionally creating and disseminating destructive programs such as computer viruses;"},{"content":"(5) Other behaviors that pose a threat to computer information network security."},{"content":"12. The user agrees to use the monitoring data in the game program as the basis for determining whether the user has engaged in game cheating behavior through the use of cheating programs and other methods."},{"content":"13. If Shifeng discovers abnormal user behavior or data, it can observe and record the user behavior, and use the results of observation and recording as the basis for determining whether the user has violated the user behavior rules of this agreement."},{"content":"Shifeng actively protects the security of users' accounts, virtual items, and virtual currencies. To this end, Shifeng takes strict measures against account theft and related activities. When Shifeng discovers or suspects the existence of account theft and related behaviors, including but not limited to the following, it has the right to handle them in accordance with the provisions of Article 6, paragraphs 14, 15, 14 and other relevant provisions of this agreement, and Shifeng reserves the right to further pursue legal action: (1) account theft; (2) Stealing virtual items; (3) Stealing virtual currency; (4) Stealing accounts and/or passwords; (5) Transfer of items under abnormal IP addresses; (6) Other account theft and related behaviors. In order to maintain fairness and order in the game, even if the user does not actively participate in account theft, if the user's items come from account theft or related activities, Shifeng has the right to decide on its own to recycle and freeze the items and accounts involved in account theft. Users should cooperate with Shifeng's investigation into account theft and related activities. Users should consciously maintain the order of the game. When Shifeng discovers or suspects false account theft complaints, they have the right to handle them in accordance with the provisions of Article 6, paragraphs 14, 15, 14 and other relevant provisions of this agreement depending on the situation."},{"content":"14. If a user violates the user behavior rules described in this article, Shifeng has the right to impose one or more of the following consequences on the user depending on the severity of the behavior, and the user shall bear such adverse consequences:"},{"content":"(1) Warning: A warning is an educational guidance aimed at minor violations of game policies, and it is a way to manage the normal operation of the game."},{"content":"(2) Forbidden: Close some or all chat channels of the violating user, forcibly suspend the online conversation function of the violating user character, so that the character cannot chat with other users until the punishment expires or is cancelled."},{"content":"(3) Force Offline: Force the violating user to leave the current game and end the execution of the user's current game program."},{"content":"(4) Account suspension: Suspend or permanently terminate the right of unauthorized users to log in to a certain game using their Shifeng account."},{"content":"(5) Temporary isolation: Transfer the game character of the violating user to a special game scene, restrict their partial game operations until the punishment expires or is cancelled."},{"content":"(6) Delete Profile: Delete the character profile of the violating user in a certain game world to prevent the character from appearing in the game world again."},{"content":"(7) Delete account: permanently terminate the right of violating users to log in to the Shifeng platform through their Shifeng account, including but not limited to user registration information, character information, level items, game currency, and all data in the game database will be permanently banned."},{"content":"(8) Retrieve game virtual items: Retrieve game virtual items obtained by unauthorized users due to fraud or other violations, including but not limited to game virtual currency and virtual items."},{"content":"(9) Change Name: Forcefully modify the forum nickname, game character, or gang name of violating users."},{"content":"(10) Dissolve organization: Dissolve gangs, guilds, and other organizations established by illegal users."},{"content":"(11) Inverted value: Deduct game values for game characters, including but not limited to game character level, money, experience, etc."},{"content":"(12) Ban IP: Temporarily or permanently prohibit unauthorized users from logging into a server of a certain game on an abnormal IP."},{"content":"(13) Take legal responsibility: If the improper behavior of the violating user causes damage to others or Shifeng, or violates current legal provisions, the violating user shall bear corresponding civil, administrative, and/or criminal responsibilities in accordance with the law. For example, if the user infringes on third-party intellectual property rights or other rights during the game process and causes the right holder to claim compensation, the user shall directly bear the responsibility."},{"content":"15. If the user violates the user behavior rules described in this article, Shifeng also has the right to demand that the violating user bear the liability for breach of contract to Shifeng, including but not limited to restoring the original state, eliminating the impact, compensating for the direct and indirect losses or additional costs caused to Shifeng, and recovering from the violating user after Shifeng first bears the administrative penalty or infringement compensation liability caused by the violating user's behavior."},{"content":"7、 Game Management"},{"content":"1. Game administrator"},{"content":"(1) Game Master (GM), also known as Game Administrator, refers to the staff of Shifeng Online who maintain and manage the order of the virtual world of the game."},{"content":"(2) GM will not interfere with the normal order of the game, will not request users' personal information and passwords in any way, and is not responsible for resolving personal disputes between users or answering questions about game strategies, tricks, etc."},{"content":"(3) Users should respect, understand, and cooperate with GM's work in the game. If they have any opinions, they should appeal and report to the customer service center through a dedicated mailbox."},{"content":"2. Transfer of game information. Shifeng has the right to arrange for the splitting or merging of game servers based on the provision of products and services. Shifeng has the right to transfer the user's character information and character files in the game to other game servers without substantial damage to the user's game rights."},{"content":"3. Parental monitoring system. Shifeng complies with national policies and has established a "Parental Guardianship System for Minors" in the game. If parents (guardians) agree to minors (especially children under the age of ten) using products and services, they must apply for registration of Shifeng accounts in the name of their parents (guardians). When using products and services, parents (guardians) should act as guardians to determine whether the products and services are suitable for minors. If the user is under 18 years old (or if Shifeng cannot identify the user's age), the user will be subject to the constraints of the "Minor Parental Guardianship System". Shifeng reserves the right to restrict users from creating or using game accounts associated with Shifeng accounts in accordance with relevant rules and parental requirements, including but not limited to temporarily or permanently freezing accounts, and partially or completely terminating the provision of Shifeng's various products and services."},{"content":"4. Anti addiction system"},{"content":"(1) If the user is under the legal age (or if Shifeng cannot identify the user's age), the user's activities in the game will be monitored by the "Game Anti Addiction System"; If the user has more than one Shifeng account, the "Game Anti Addiction System" will apply to all Shifeng accounts of the user simultaneously;"},{"content":"(2) The "Game Addiction Prevention System" regulates users' behavior of playing continuously for a long time by gradually deducting in-game income based on continuous game time;"},{"content":"(3) Users are required to provide truthful and complete information in order for Shifeng to identify their identity and submit real name authentication information to relevant departments. Any consequences arising from the untrue information provided shall be borne by the users themselves."},{"content":"5. Under the existing technological conditions, Shifeng will make reasonable commercial efforts and develop and maintain the "Parental Guardianship System for Minors", "Game Addiction Prevention System" and real name authentication system in accordance with the requirements of relevant regulatory departments, and provide them to users for use "as is". Due to the inevitable limitations of technology and the influence of external factors on various aspects of system operation, Shifeng does not guarantee that there are no vulnerabilities in each system, that each system can operate normally at any time, or that the monitoring or authentication effect is completely correct, true, or meets the needs of users. Shifeng does not provide any express or implied warranties beyond those expressly provided by applicable laws and assumes no responsibility for them."},{"content":"8、 Tariff policy"},{"content":"1. The charging information of Shifeng products and services, as well as related tariff standards, charging methods, purchasing methods, and other relevant tariff policies, shall be explained on Shifeng related platforms or game websites (including but not limited to Shifeng and corresponding game official websites, etc.)."},{"content":"2. Shifeng has the right to determine the tariff standards and charging methods for the products and services provided by Shifeng. Shifeng may establish different tariff standards and charging methods for different products and services, and may also determine different tariff standards and charging methods based on the different stages of Shifeng's products and services. In addition, Shifeng may occasionally modify its tariff policies. Shifeng will prominently display information on the pricing of products and services, as well as tariff standards, charging methods, purchasing methods, or other relevant tariff policies related to the products and services, on the relevant web pages of the products and services."},{"content":"3. For Shifeng's paid products and services, users should purchase Shifeng's products and services according to the tariff policies determined by Shifeng. If the user fails to purchase Shifeng's products and services according to the tariff policy determined by Shifeng, Shifeng may immediately stop providing the product and service to the user."},{"content":"4. Unless otherwise expressly provided by law, users shall not request Shifeng to refund any fees already paid by the user to Shifeng (hereinafter referred to as "refund"), regardless of whether such fees have been consumed. Shifeng has the right to decide whether, when, and how to refund users. If Shifeng agrees to a refund, the user shall compensate for the fees incurred by using credit cards, mobile phones, and other payment channels during the payment process. Shifeng has the right to directly deduct the fees from the refunded fees to the user. The recharge amount, virtual currency, virtual props, etc. gifted by Shifeng during the provision of products and services will not be refunded or monetized."},{"content":"9、 Virtual Items"},{"content":"1. The ownership of various virtual items provided by Shifeng (including but not limited to game platforms, games, forums), such as gold coins, silver coins, props, equipment, etc., belongs to Shifeng or its partners. Users can only have the right to use virtual items in compliance with laws and game rules. Once a user purchases the right to use a virtual item, it will be considered as having entered the consumption process and cannot request a refund of the virtual item for any reason."},{"content":"2. Except for large-scale server disconnections, if a character is deleted or recalled, virtual items or money are lost due to reasons not attributable to Shifeng, such as local network problems or personal operation issues, Shifeng shall not be liable to the user."},{"content":"3. Given the complexity of online transactions, except for the official trading platform designated by Shifeng, Shifeng prohibits users from engaging in offline trading of game virtual items and related activities. Shifeng opposes users engaging in offline trading of virtual items and related activities (including but not limited to participating in offline trading, assisting offline traders in operating and transferring game virtual items, etc.), and does not protect any transaction results generated from offline trading. Any problems or disputes arising from offline trading between users, including but not limited to being defrauded of money or game virtual items by false trading information, are not related to Shifeng and users will be responsible for them. Shifeng is not responsible for compensating or recovering losses caused by fraud."},{"content":"4. Except for the official trading platform designated by Shifeng, Shifeng does not recognize the trading results generated by users' offline exchanges. Game virtual items obtained by users through offline exchanges will be deemed as originating from sources that do not comply with game rules. Shifeng has the right to take corresponding measures against game virtual items, game characters, and Shifeng accounts involved in offline transactions and related activities in accordance with the provisions of Article 6 of this Agreement."},{"content":"10、 Changes in service methods, content, and transfer of personal information"},{"content":"1. Shifeng will make every effort to continuously provide products and services to users, but within the maximum scope permitted by applicable laws, Shifeng does not rule out the possibility of stopping providing any products and services, nor does it rule out the possibility of changing the service mode and content of game services or other network services."},{"content":"2. In order to increase and enrich the content of Shifengzhi's games and other online services, games and game platforms may periodically update and adjust their included features during runtime. After the game and game platform update, all operations, content, and settings within the game and game platform will be based on the announcement content in the game and game platform."},{"content":"3. If Shifeng ceases to provide a certain product or service, or changes the way or content of a certain product or service, Shifeng will notify the user in advance and make every effort to find an appropriate service provider to replace Shifeng in continuing to provide products and services."},{"content":"4. In the circumstances described in paragraph 3 of this article and to the maximum extent permitted by applicable law, Shifeng may transfer the user's personal information (including relevant account and password information and personal information) to the party continuing to provide services. The user hereby agrees that Shifeng has the right to make such transfer and provision, and agrees that after Shifeng completes the transfer and provision, Shifeng will no longer assume any obligations or responsibilities for the user's original information. However, Shifeng does not guarantee that it will be able to find suitable service providers or service methods to replace Shifeng in continuing to provide products and services, nor does it guarantee that the products and services provided by the service providers or the changed game modes found by Shifeng will meet the requirements of users."},{"content":"11、 Service interruption or termination"},{"content":"If any of the following situations occur, Shifeng has the right to interrupt or terminate the provision of game services and other network services to users under this agreement at any time. Shifeng shall not be liable for any inconvenience or loss arising therefrom:"},{"content":"(1) The personal information provided by the user is not truthful;"},{"content":"(2) The user violates the user code of conduct stipulated in this agreement."},{"content":"2. The user is fully aware that the Shifeng account has a validity period and agrees to log in to the Shifeng account from time to time to extend its validity period. The user is fully aware that Shifeng has the right to cancel any Shifeng account that has exceeded its validity period and delete the information content in that account."},{"content":"(1) After registering an account, the user has no login or usage record for a long time, and the account has no recharge record; Shifeng has the right to immediately cancel the account and delete the information content in the account."},{"content":"(2) Regarding other conditions for account/role cancellation for different products and services provided by Shifeng, please refer to the specific regulations of each product and service, or the specific regulations on the official websites of related products and services."},{"content":"3. In order to ensure the normal operation of the game and game platform websites and servers, Shifeng needs to regularly or irregularly shut down and maintain the game and game platform websites and servers, or conduct emergency shutdown maintenance in case of emergencies. The normal service interruption or suspension caused by the above situation is understood and agreed by the user, and Shifeng has the obligation to try its best to avoid service interruption and limit the interruption time to the shortest possible time."},{"content":"4. Within the maximum scope permitted by applicable laws, in the event of any of the following circumstances, in order to ensure the continuous and stable operation of the game website and server, Shifeng has the right to terminate or interrupt all or part of the services provided by the game server without prior notice. Shifeng shall not be liable to users or third parties for any inconvenience or losses arising therefrom:"},{"content":"(1) Regular inspections or construction, updating software and hardware, etc;"},{"content":"(2) The server is damaged and unable to function properly;"},{"content":"(3) Sudden software and hardware equipment and electronic communication equipment failures;"},{"content":"(4) Network provider line or other faults;"},{"content":"(5) In emergency situations, in accordance with legal provisions or for the personal safety of users and third parties;"},{"content":"(6) Third party reasons or other force majeure situations."},{"content":"5. Within the maximum scope permitted by applicable laws, regardless of the termination of products and services for any reason, users should take corresponding measures to dispose of the game and virtual items on the game platform on their own. Users shall not demand that Shifeng bear any form of compensation or liability other than game virtual currency that the user has purchased but not yet used, including but not limited to compensation for the inability to continue using the game account, virtual items in the game, etc., due to the termination of the service."},{"content":"12、 Limited Warranty and Disclaimer"},{"content":"1. For Shifeng's products and services, Shifeng only makes the limited warranty described in this clause, which supersedes any other express or implied warranties (if any) in any documents, packaging, or other materials."},{"content":"2. Shifeng only provides relevant products, software or programs and any support services in the form of "existing condition and including all errors", and only guarantees:"},{"content":"(1) The products and services provided by Shifeng can basically meet the requirements officially announced by Shifeng;"},{"content":"(2) The relevant products and services provided by Shifeng are basically consistent with the service commitments officially announced by Shifeng;"},{"content":"(3) Shifeng shall only make reasonable efforts to solve any problems encountered by Shifeng in the process of providing products and services within the commercially permissible scope."},{"content":"3. To the maximum extent permitted by applicable law, Shifeng expressly disclaims any other type of warranty, whether express or implied, including but not limited to any implied warranties and liabilities of merchantability, fitness for purpose, reliability, accuracy, completeness, and error free nature."},{"content":"4. To the maximum extent permitted by applicable laws, Shifeng does not guarantee that the products and services provided by Shifeng will definitely meet the requirements of users, nor does it guarantee that the products and services provided will not be interrupted, nor does it guarantee the timeliness, security, and non-interference of the products and services, nor does it guarantee that there will be no errors, and that the information will be transmitted accurately, timely, and smoothly."},{"content":"5. The user understands and agrees that the trust and use of any information and materials obtained through Shifeng's products and services are entirely up to the user, and the user shall bear any system damage, data loss, and any other risks caused by such trust and use. Shifeng does not guarantee any product shopping services, transaction processes, recruitment information, especially information sent by third parties, mentioned in its products and services."},{"content":"6. In case of system failures, security vulnerabilities, program defects, program errors, etc., Shifeng has the right to restore the game's data to a certain date to maintain the balance of the game. Users shall not demand compensation or indemnification for this reason."},{"content":"7. To the maximum extent permitted by applicable laws, Shifeng shall not be liable for any indirect, incidental, accidental, special or consequential damages (including but not limited to personal injury, privacy breaches, failure to fulfill any responsibility including good faith or reasonable care, damages caused by negligence and any other monetary or other losses) arising from the use of Shifeng's products and services by users, which may arise from: improper use of products and services by users or others, online purchase of goods or similar services, online transactions, illegal use of services, or changes in information transmitted by users."},{"content":"8. Shifeng shall not be liable for any technical defects, coverage limitations, force majeure, computer viruses, hacker attacks, user location, user shutdown, cooperative factors, intentional or negligent behavior of others, or other reasons beyond Shifeng's technical capabilities that cause service interruptions, loss of data or short message content sent by users, garbled characters, incorrect reception, inability to receive, delayed reception, etc. in the fixed and mobile communication networks of domestic and foreign basic telecommunications operators involved under this agreement."},{"content":"9. Any consequences resulting from the user's personal errors, mistakes, or improper operations shall be borne by the user themselves, and Shifeng shall not provide any compensation or indemnification."},{"content":"13、 Intellectual Property and Information Ownership"},{"content":"1. The copyright, patent rights, trademark exclusive rights, and other intellectual property rights of the game software (including games with and without client software), other software, information, works, and materials provided by Shifeng through its products and services are owned by Shifeng or its corresponding rights holders. Unless authorized in writing by Shifeng in advance or otherwise expressly provided by law, no one shall use, copy, disseminate, forge, imitate, modify, adapt, translate, compile, publish, decompile or decompile in any form without authorization. Otherwise, Shifeng has the right to immediately terminate the provision of products and services to users and pursue its intellectual property infringement liability in accordance with the law, demanding that users compensate Shifeng for all losses."},{"content":"2. Any data information (including but not limited to account data information, role data information, grade item data information, etc., but excluding the user's name, ID number, telephone number and other personal identity data information) generated by the user in the process of using the products and services and stored in the Shifeng server is part of the game or the game platform, owned and managed by Shifeng. The user has the right to modify, transfer and punish the data information belonging to his own account through the way designated by Shifeng on the premise of abiding by the rules of the game."},{"content":"3. To ensure accuracy and avoid disputes, the user agrees to use the data stored on the Shifeng server as the judgment standard for the technical data and information involved in this agreement. Shifeng guarantees the authenticity of this data."},{"content":"14、 Compensation for damages"},{"content":"If the user violates this agreement or applicable laws and regulations, resulting in damages or any derivative expenses incurred by Shifeng's parent company, subsidiaries, other affiliated companies, affiliates and their personnel, employees, agents and all other related performance support personnel (including but not limited to paying all legal fees for defense or claims litigation and related settlements that the above-mentioned legal entities must undertake regarding the user's breach or illegal behavior), the user shall bear the responsibility for compensating the relevant expenses and paying damages."},{"content":"15、 Termination of the Agreement"},{"content":"Users shall comply with the provisions of this agreement and relevant laws and regulations. Shifeng has the right to determine whether the user has violated this agreement. If Shifeng determines that the user violates this agreement or any laws and regulations, Shifeng has the right to immediately suspend or terminate the user's account and delete all relevant information, files, and any records in the user's account, as well as restrict, stop, or cancel the user's usage qualification without prior notice to the user."},{"content":"16、 Right to modify and interpret"},{"content":"In order to provide products and services to users in a timely and better manner, based on the constantly changing considerations of Shifeng itself, users, and market conditions, Shifeng reserves the right to modify, add, or delete the terms of this agreement at any time within the maximum scope of legal application. When modifying, adding, or deleting terms of this agreement, Shifeng will announce the fact of the modification, addition, or deletion on its official website without separately notifying users. If users do not agree with the modifications, additions, or deletions made by Shifeng, they may immediately stop using the services provided by Shifeng. If the user continues to use the services provided by Shifeng, it shall be deemed that the user agrees and accepts the modified, added, or deleted content of this agreement, and shall not request any compensation or indemnification as a result."},{"content":"2. Without the prior written consent of Shifeng, the user shall not transfer their rights or obligations under this agreement. Shifeng has the right to exercise its rights or fulfill its obligations under this Agreement through its subsidiaries or other affiliated companies."},{"content":"17、 Advertising and External Links"},{"content":"1. Shifeng's products and services may contain commercial advertisements or promotional advertisements from others. These contents are provided by advertisers or product/service providers and bear corresponding responsibilities, and Shifeng only provides the medium for publishing the contents. The transaction behavior of such services or goods purchased by users through Shifeng or the websites linked by Shifeng only exists between the user and the provider of such goods or services, and has nothing to do with Shifeng. Shifeng shall not bear any legal responsibility for the transaction behavior between the user and the provider of such goods or services."},{"content":"2. Users may link to third-party websites while using Shifeng's products and services. Third party sites are not controlled by Shifeng, and Shifeng is not responsible for the content of any third-party sites, any links contained in third-party sites, or any changes or updates to third-party sites. Shifeng only provides users with these links to third-party sites for the purpose of convenience. The links provided by Shifeng do not imply that Shifeng approves of the third-party site, nor does it guarantee its authenticity, completeness, real-time performance, or credibility. There is no employment, appointment, agency, partnership or other similar relationship between these individuals, companies or organizations and Shifeng. Users need to check and comply with the relevant regulations of the third-party site."},{"content":"3. The user understands and agrees that Shifeng sends products, services, or other related business information to the user via email, text message, or other means."},{"content":"18、 Other Agreements"},{"content":"The formation, validity, interpretation, performance, and dispute resolution of this agreement shall be governed by the laws of the People's Republic of China. If any content of this agreement conflicts with the law, the legal provisions shall prevail."},{"content":"2. If any provision of this agreement is partially or completely invalid, it shall not affect the validity of other provisions."},{"content":"3. If any disputes arise between the parties regarding the content or execution of this agreement, including but not limited to contract disputes or property rights infringement disputes arising from penalties imposed by Shifeng on users under this agreement, the parties shall try their best to resolve them through friendly negotiation; When the negotiation fails, the user and Shifeng agree to submit the dispute to the people's court with jurisdiction over the place where this agreement is signed."},{"content":"4. This agreement shall be signed and come into effect in Yongkang City, China on the date when the user completes the registration of their Shifeng account. Even if the user has not completed the registration of a Shifeng account, if they obtain and use the products and services provided by Shifeng through any other means, this agreement shall be deemed to be signed and effective on the date when the user obtains and uses the products and services."},{"content":"5. How to contact us"},{"content":"We have established a dedicated department for personal information protection, which will protect your personal information in accordance with this policy. If you have any complaints or reports about network information security, or if you have any questions, opinions, or suggestions regarding this policy, Shifeng's privacy measures, or your relevant rights and interests in information, please contact Shifeng's personal information protection staff. You can send an email to lukaichun@gdsftoys.com Or write to the following address: Room 902, Building 8, Qianhai Excellence Financial Center (Phase I), Guiwan Area, Nanshan Street, Qianhai Shenzhen Hong Kong Cooperation Zone, Shenzhen. Personal Information Protection Officer, Shifeng (Shenzhen) Network Technology Co., Ltd; Postal code: 518000. Generally, we will respond within fifteen working days after receiving your questions, opinions, or suggestions and verifying your user identity. If you are not satisfied with our response, you can also file a complaint with the consumer rights protection department or file a lawsuit with a court with jurisdiction."}],"PrivacyCfg":[{"content":"Privacy Protection Policy"},{"content":"This rule was updated on May 18th, 2023"},{"content":"This rule takes effect on May 18th, 2023"},{"content":"Shifeng (Shenzhen) Network Technology Co., Ltd. (referred to as "we") understands the importance of personal information to you and will do our best to protect the security and reliability of your personal information. This privacy protection policy explains how we will collect and use your personal information and help you understand your rights. Please read and understand this privacy protection policy carefully before using our services."},{"content":"【 Special Reminder 】 Please carefully read this Privacy Policy (especially the bolded and underlined content) and confirm that you understand our rules for handling your personal information. If you have any questions while reading or using our game, you can contact our customer service for consultation. If you do not agree to any terms in this privacy protection policy, you should immediately stop accessing and using it."},{"content":"This privacy protection policy will help you understand the following:"},{"content":"1、 Definition"},{"content":"2、 How do we collect and use your personal information"},{"content":"3、 How do we use cookies and similar technologies"},{"content":"4、 How do we share, transfer, and publicly disclose your personal information"},{"content":"5、 How do we protect and preserve your personal information"},{"content":"6、 Your rights"},{"content":"7、 Protection of Minors"},{"content":"8、 How to update this privacy protection policy"},{"content":"9、 Scope of application"},{"content":"10、 How to contact us"},{"content":"1、 Definition"},{"content":"Personal information: refers to various types of information recorded electronically or in other ways that can be used alone or in combination with other information to identify the identity of a specific natural person or reflect the activities of a specific natural person. The types of personal information referred to in this privacy protection policy are listed in the clause "How We Collect and Use Your Personal Information"."},{"content":"Sensitive personal information: refers to personal information that, once leaked, illegally provided, or abused, may endanger personal and property safety, and is highly likely to cause damage to personal reputation, physical and mental health, or discriminatory treatment. The sensitive personal information covered by this privacy protection policy includes: your property information (including bank accounts, transaction and consumption records, as well as virtual currency, virtual transaction game exchange codes, and other virtual property information); Personal identification information (including ID card); Network identity recognition information (including account name, account nickname, IP address, etc.); Personal information of children under 14 years old (including); Other information (including contact list, webpage browsing history). For the sensitive personal information listed in this privacy protection policy, in order to help you be alert when reading, we will not only define and list it uniformly here, but also highlight it in bold font, underline, or separately in this privacy protection policy to remind you to pay attention."},{"content":"2、 How do we collect and use your personal information"},{"content":"During your use of gaming services, we will collect and use your personal information for the following purposes as described in this privacy policy:"},{"content":"（1） Register and use our services"},{"content":"When you register or use our game services, we collect your network identity information and personal commonly used device information to mark you as a user of our game. You can choose to create an account for the game service and log in by logging in with your phone number or third-party account."},{"content":"When you choose the mobile login method, you need to provide us with your phone number for identification and verification of your identity."},{"content":"When you choose to register and log in to your game user account through a third-party channel/platform account that we cooperate with, it is deemed that you agree to authorize us to access, collect, and use your personal information collected by the third party. We will indirectly access and collect your authorized personal information (such as your avatar, nickname, authentication information, relationship chain, region, etc. in the third-party account, subject to the public information and permissions authorized by different third-party accounts) and bind your third-party account with your game registration account."},{"content":"During the process of registering as a game user and using the game, you can independently choose to provide your nickname (including real name), gender, avatar (including real avatar), birthday, zodiac sign, location, and personal introduction information ("Supplementary Information"), which will help us provide you with better game user services."},{"content":"（2） Provide you with game user authentication services"},{"content":"In order to meet the relevant laws and regulations and the regulatory requirements of the competent authorities, we provide you with certification services. You need to provide us and the third-party certification authority that provides certification services with your name and ID number information. After completing user authentication, you can better enjoy the related services provided by the game, otherwise you cannot log in to the game."},{"content":"（3） Game operation statistical analysis"},{"content":"When you use the game services we provide, we collect your game log information, such as login logs, item logs, operation information, game match information, friendship records, login account, game ID, search query content, IP address, network environment, duration of stay, publishing records, and refresh records, so that you can view your game history on the client side, and use it for game operation statistical analysis, customer service complaint handling, and other game security analysis. We may synchronize the above information to subsequent versions of the game or other products we provide that you are currently using."},{"content":"（4） Provide you with fast identification, fast payment and other services"},{"content":"To enhance the user experience and convenience of game services, we may collect your personal information by calling device permissions, and you may also need to manually fill in some information during the use of game services."},{"content":"To quickly identify/add/invite friends around your location, you can choose to authorize us to call location permissions on your device."},{"content":"2. To quickly identify/add/invite your contact list friends, you can choose to authorize us to call the contact list permissions in your device."},{"content":"3. If you wish to upload your avatar and/or other image information/or audio and video information to the game, you can choose to authorize the game to call the camera, album, microphone, and device location permissions in your device."},{"content":"4. If you want to complete payment quickly and conveniently through a third-party mobile operator or payment platform, with your device's support, you can choose to authorize the use of mobile operation and payment voucher related permissions (such as SMS, Alipay, WeChat) in your device, so that you can complete payment quickly and conveniently."},{"content":"（5） To provide you with social interaction and related services"},{"content":"When you engage in social interactions with other users through games (such as adding friends, giving away energy, private messages, and other rich product features), we will collect the accounts and content that you follow and display them to you; We may also collect and use your account information, mobile phone number, and email contact information to provide you with customer service inquiries and interactive communication services."},{"content":"When you use the recommended contact list friend function, we will request your explicit consent and use it to recommend friends in your contact list, and your friends can also see that you are using our game services."},{"content":"3. When you interact with other players in the game through text, images, voice, video, and other means, we may collect and store the information you send to filter inappropriate content such as pornography, violence, politics, insults, malicious advertisements, etc., in order to purify the game environment and maintain a healthy online environment."},{"content":"4. If you wish to interact with other game players and participate in live broadcasts through images, voice, or videos, with your authorization and consent, the game will access your photos or stored files, microphone, camera, and provide you with functions such as screenshot saving, image uploading, voice chat, and live interaction."},{"content":"（6） Purchase virtual items, physical goods and services"},{"content":"When you search and purchase virtual items, as well as physical goods and services through the game, we will collect and record your recharge, transaction, and balance information. When it is necessary to send the goods, you need to provide the recipient's name, address, postal code, and contact phone information. If we (or the actual seller) entrust a third party to deliver to you, we will share the above information with the third party according to the necessary information requirements for delivery."},{"content":"（7） Customer Service"},{"content":"When you use the game services we provide, you may contact game customer service for account management, recharge, and other issues. You may need to provide us with your phone number, recharge records, virtual property related information, system operation records, photos, and information related to your use of game products and/or services, so that our customer service can contact you and help you solve related problems."},{"content":"（8） Ensure the normal provision of services"},{"content":"To ensure your normal use of our services, maintain the normal operation of basic game functions, optimize game product performance, enhance your gaming experience, and safeguard your account security, we will collect your device ID, device name, device type and version, system version, IP address, device identification information (such as IMEI, ICCID, IMSI, MAC address), software installation list, device serial number, SMS, and network type information."},{"content":"（9） To provide you with security protection"},{"content":"In order to improve the security of your use of our services, protect the personal and property safety of you, other users, or the public from infringement, better prevent security risks such as phishing websites, fraud, network vulnerabilities, computer viruses, network attacks, and network intrusions, and more accurately identify violations of laws, regulations, or game related agreement rules, we may use or integrate your registration information, device information, network logs, as well as information about the applications you have installed, running processes, overall operation of the applications, frequency of application usage, crash data, overall installation and usage, performance data, and information about the sources of the applications to comprehensively judge your account and transaction risks, verify your identity, detect and prevent security incidents, and take necessary records in accordance with the law. Audit, analysis Disposal measures. For example, we will comprehensively analyze user account activity anomalies, multi terminal login, traffic anomalies, etc. to protect your account security."},{"content":"（10） Exceptions to obtaining authorization and consent"},{"content":"According to relevant laws and regulations, collecting your personal information in the following situations does not require your authorization and consent:"},{"content":"(1) Necessary for the conclusion and performance of contracts to which an individual is a party, or for the implementation of human resource management in accordance with labor rules and regulations formulated in accordance with the law and collective contracts signed in accordance with the law;"},{"content":"(2) Necessary for fulfilling statutory duties or obligations;"},{"content":"(3) Necessary to respond to sudden public health emergencies or to protect the life, health, and property safety of natural persons in emergency situations;"},{"content":"(4) To carry out news reporting, public opinion supervision and other activities for the public interest, and to process personal information within a reasonable range;"},{"content":"(5) Process personal information that individuals have voluntarily disclosed or other legally disclosed within a reasonable scope in accordance with the provisions of this law;"},{"content":"(6) Other circumstances stipulated by laws and administrative regulations."},{"content":"Special Explanation on Intermodal Channel Scenarios"},{"content":"We will provide our services through third-party application distribution platforms/channels. In this channel scenario, you download and use our services through the channel, and the channel provides you with account creation, management, and payment related services in its own name, as well as real name authentication."},{"content":"If you obtain our services through a channel, when you download, install or use our services through the channel, the channel collects your personal information from our services as an independent personal information processor and is responsible for the collected information in its own name. We suggest that you carefully read and understand the personal information protection policy or relevant instructions of the channel party to understand their specific policies on personal information protection."},{"content":"3、 How do we use cookies and similar technologies"},{"content":"Cookies, device information identification and other similar technologies are widely used in the Internet. To ensure the normal operation of the game and provide you with an easier access experience, we or our third-party partners will store small data files called cookies on your mobile device. With the help of cookies, websites and clients can store your registered account, email, password (encrypted) and other data, helping you save the steps and processes of repeatedly filling in information and entering search content. We may set authentication and security cookies or anonymous identifiers to confirm whether you have safely logged into the service or encountered theft, fraud, and other illegal activities. These technologies will also help us improve service efficiency, enhance login and response speed."},{"content":"We will not use cookies for any purposes other than those stated in this privacy policy. You can manage or delete cookies on your own. You can clear all cookies saved on your mobile device, but if you do so, you will need to personally change user settings every time you use the game. You can also choose not to be tracked by deleting cookies and restoring (clearing) mobile terminal settings (content and data)."},{"content":"4、 How do we share, transfer, and publicly disclose your personal information"},{"content":"（1） Sharing and Disclosure"},{"content":"We will not share your personal information with any company, organization, or individual outside of us, except in the following circumstances:"},{"content":"1. Share with your (and your guardian's) explicit consent or authorization, or with your voluntary choice."},{"content":"2. Sharing under legal circumstances. We may share your personal information with external parties in accordance with laws and regulations, litigation dispute resolution needs, or as required by administrative or judicial authorities in accordance with the law. For example, if we determine that you have violated laws and regulations or seriously violated our relevant agreement rules, or to protect the personal and property safety of our affiliated company users or the public from infringement, we may disclose personal information about you in accordance with laws and regulations or platform related agreement rules, including relevant violations and measures we have taken against you."},{"content":"3. Share your personal information with our affiliates. In such cases, we will only share necessary personal information and be bound by the purposes stated in this privacy protection policy. If our affiliates want to change the purpose of processing personal information, they will seek your authorization and consent again."},{"content":"4. Sharing with our authorized partners: Only for the purposes stated in this privacy protection policy, some of our services will be jointly provided by us and our authorized partners. We may share some of your personal information with our partners to provide better customer service and user experience. We will only share your personal information for legal, legitimate, necessary, specific, and clear purposes, and will only share personal information necessary for providing services. Our partners have no right to use shared personal information for purposes unrelated to the product or service. At present, our authorized partners include the following types:"},{"content":"a) To achieve advertising, promotion, and sharing with advertising and statistical analysis partners. We will only provide these partners with user profile tags that cannot identify your personal identity information, as well as device information or statistical information that has been de identified or anonymized, in order to help them improve the effective reach of information without identifying your personal identity. Unless we obtain your permission, we will not share your personal identification information (referring to information that can identify you, such as name or phone number, through which you can be contacted or identified) with partners who provide advertising and analytics services."},{"content":"b) Proxy products"},{"content":"If you use game products distributed by our agents, we may share the logs and related information (such as login logs, etc.) generated by you in the game with the development entity or relevant third parties for game security analysis, improving game services, and further optimizing users' game experience. If we share the aforementioned information, we will strictly take corresponding compliance measures in accordance with relevant laws and regulations to ensure that personal information sharing complies with relevant legal provisions. The aforementioned compliance measures include but are not limited to requiring the development entity or relevant third parties to strictly comply with the privacy protection policy and the agreement reached with you to collect and use your personal information, urging the development entity or relevant third parties to adopt appropriate security technologies and management measures to ensure the security of your personal information, etc."},{"content":"c) Sharing with suppliers, service providers, and other partners. We send information to software service providers, smart device providers, system service providers, and other partners who support our business (such as hardware manufacturers, telecom operators, payment service providers, map service providers, etc.) to obtain your device information. This support includes providing technical infrastructure services, analyzing how our services are used, providing customer service, facilitating payments, or conducting academic research and surveys. We will sign strict data protection agreements with the shared objects, requiring them to process personal information in accordance with our instructions, this privacy protection policy, and any other relevant confidentiality and security measures. If we share your sensitive personal information or authorize our partners to change the purpose of using and processing your personal information, we will seek your authorization and consent again."},{"content":"In order to enable you to perform third-party login, payment, receive information push notifications, share information on third-party platforms, use location services, and other services and functions mentioned above, we will embed authorized partner software development kits (SDKs) or other similar applications in the provided products and conduct strict security checks to protect data security. We have listed the SDK related situations involving the use of user information."},{"content":"Personal information that we may share"},{"content":"(1) To achieve the sharing of related functions or services with related parties"},{"content":"To ensure the consistency of the services you receive between the products provided by us and our affiliates, and to facilitate unified management of your information, we will share your de identified personal information with these affiliates."},{"content":"(2) To achieve programmatic advertising push, we may share de identified or anonymized information with advertising partners"},{"content":"We may share information with partners who entrust us with promotion and advertising, but we will not share information used to identify your personal identity, such as your name, ID number number, etc. We will only provide these partners with user portrait tags that are difficult to identify your personal identity, information or location information after de identification or anonymization to help them improve the effective reach rate of advertising without identifying your personal identity."},{"content":"(3) Sharing with business partners to achieve specific functionalities"},{"content":"When you use the features provided by our affiliates or third parties in this game, or when software service providers, smart device providers, or system service providers collaborate with us to provide services to you, we will share the necessary information for business implementation with these affiliates or third parties for comprehensive statistics and algorithm based feature and preference analysis, forming indirect demographic profiles to recommend, display, or push information that you may be interested in, or push specific features, services, or commercial advertisements that are more suitable for you."},{"content":"(4) Assist you in participating in marketing and promotional activities"},{"content":"When you choose to participate in marketing activities organized by us and our affiliates or third parties, you may need to provide information such as name, mailing address, contact information, bank account number, etc., which contains sensitive personal information. Refusing to provide this information may affect your participation in related activities, but will not affect other functions. With your consent, we may share the above information with affiliated parties or third parties to ensure that you receive consistent service experience in joint activities, or entrust third parties to promptly redeem rewards to you."},{"content":"5. Assist in resolving disputes. For example, if you are accused of intellectual property infringement or content violation while using our products and/or services in our game, and if a qualified complainant, judicial agency, or administrative enforcement agency requests information disclosure, we will provide necessary information such as the contact information of the complained user to the aforementioned agency or individual as appropriate to facilitate the resolution of the dispute. We only assume corresponding legal responsibilities when there are clear legal provisions."},{"content":"6. Third party software or technology. In order for you to use our product normally, we may use third-party software or technology, which may collect your device information."},{"content":"（2） Transfer"},{"content":"We will not transfer your personal information to any company, organization, or individual, except in the following circumstances:"},{"content":"1. Transfer with explicit consent: After obtaining your explicit consent, we will transfer your personal information to other parties;"},{"content":"2. In the event of a merger, acquisition or bankruptcy liquidation, or any other situation involving the transfer of personal information, we will inform you of the relevant situation and require the new company or organization holding your personal information to continue to be bound by this privacy protection policy. Otherwise, we will require the company, organization or individual to seek authorization and consent from you again."},{"content":"（3） Public disclosure"},{"content":"Personal information should not be publicly disclosed in principle. When it is necessary to disclose your personal information publicly, we will do so only after taking security measures that comply with industry standards"},{"content":"1. According to your needs, disclose the personal information you have specified in the disclosure method that you have explicitly agreed to;"},{"content":"2. In cases where it is required by laws, regulations, mandatory administrative law enforcement or judicial requirements to provide your personal information, we may publicly disclose your personal information based on the required type and disclosure method. Subject to compliance with laws and regulations, when we receive a request for disclosure of the aforementioned information, we will require the issuance of corresponding legal documents, such as subpoenas or investigation letters. We firmly believe that the information requested from us should be kept as transparent as possible within the limits permitted by law. We will carefully review all requests to ensure that they have legal basis and are limited to data obtained by law enforcement agencies for specific investigation purposes and with legitimate rights."},{"content":"（4） Exceptions to obtaining prior authorization and consent for sharing, transferring, or publicly disclosing personal information"},{"content":"According to relevant laws and regulations, sharing, transferring, and publicly disclosing your personal information does not require your prior authorization and consent in the following situations:"},{"content":"(1) Directly related to national security and defense security;"},{"content":"(2) Directly related to public safety, public health, and major public interests;"},{"content":"(3) Directly related to criminal investigation, prosecution, trial, and execution of judgments;"},{"content":"(4) For the purpose of safeguarding the significant legitimate rights and interests of personal information subjects or other individuals, such as life and property, but it is difficult to obtain their consent;"},{"content":"(5) Personal information that the individual discloses to the public on their own;"},{"content":"(6) Other situations stipulated by laws and regulations."},{"content":"According to legal regulations, sharing and transferring personal information that has undergone de identification processing, and ensuring that the data recipient cannot recover and re identify the personal information subject, does not constitute external sharing, transfer, or public disclosure of personal information. The storage and processing of such data will not require separate notification to you and your consent."},{"content":"5、 How do we protect and preserve your personal information"},{"content":"（1） Technical protection:"},{"content":"To ensure your information security, we strive to adopt various reasonable physical, electronic, and management security measures that comply with industry standards to protect your information, so that it will not be leaked, damaged, or lost, including but not limited to SSL, information encryption storage, and data center access control. We will use encryption technology to enhance the security of personal information; We will use trusted protection mechanisms to prevent personal information from being maliciously attacked; We will deploy access control mechanisms to ensure that only authorized personnel can access personal information."},{"content":"（2） Security system assurance:"},{"content":"We have an industry-leading data security management system centered around data lifecycle, which enhances the security of the entire system from multiple dimensions such as organizational construction, system design, personnel management, product technology, and personal information security impact assessment."},{"content":"（3） Personnel safety management:"},{"content":"We have also implemented strict management measures for employees or outsourced personnel who may have access to your information, including but not limited to implementing different permission controls based on their positions, signing confidentiality agreements with them, and monitoring their operations. We will provide corresponding security measures based on existing technology to protect your information and provide reasonable security guarantees. We will do our best to ensure that your information is not leaked, damaged or lost. We will hold security and privacy protection training courses to enhance employees' awareness of the importance of protecting personal information."},{"content":"（4） Sensitive information and password protection tips:"},{"content":"1. Attention to the protection of sensitive personal information: The information you voluntarily share or even publicly share when using our services may involve your or others' personal information or even sensitive personal information, such as uploading your profile picture, or choosing to upload pictures containing personal information when commenting, posting, or posting bullet comments. Please consider more carefully whether to share or even publicly share relevant information when using our services."},{"content":"2. Please use a complex password to help us ensure the security of your account. We will do our best to ensure the security of any information you send to us. If our physical, technological, or management protective facilities are damaged, resulting in unauthorized access, public disclosure, tampering, or destruction of information, which damages your legitimate rights and interests, we will bear corresponding legal responsibilities."},{"content":"3. Your account has security protection functions, please keep your account and password information safe. We will ensure that your information is not lost, abused, or altered through security measures such as backing up to other servers and encrypting user passwords. Despite the aforementioned security measures, please understand that there are no "perfect security measures" on information networks."},{"content":"4. Information disclosure tips and password disclosure handling: please note that the Internet is not an absolutely secure environment. When using certain services on our platform, it is inevitable for you to disclose your personal information, such as bank account information, contact information, or postal address, to the counterparty or potential counterparty. Please protect your personal information properly and only provide it to others when necessary. If you discover that your personal information has been leaked, especially your account and password, please contact our customer service immediately so that we can take appropriate measures."},{"content":"（5） Information security incident handling"},{"content":"After an unfortunate personal information security incident occurs, we will inform you of the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, suggestions for you to independently prevent and reduce risks, and remedial measures for you in accordance with legal requirements. We will inform you of the relevant situation of the event through email, letter, phone, push notifications, etc. When it is difficult to inform individual information subjects one by one, we will adopt a reasonable and effective way to publish an announcement. At the same time, we will also report the handling of personal information security incidents in accordance with regulatory requirements."},{"content":"（6） How do we store your personal information:"},{"content":"1. Storage location: We will store the personal information collected and generated during our operations within the territory of the People's Republic of China in accordance with laws and regulations."},{"content":"2. Storage period: We will take reasonable and feasible measures to avoid collecting irrelevant personal information. We will only retain your personal information for the shortest period of time necessary to achieve the purposes stated in this privacy protection policy, unless you agree to extend the retention period or are permitted by law. After exceeding the retention period, we will delete your personal information or take technical measures to anonymize it, except as otherwise provided by laws and regulations."},{"content":"6、 Your rights"},{"content":"（1） Query and correct your personal information"},{"content":"After completing the registration, login, and necessary identity verification of your game account, you have the right to query and correct your personal information on your own. You can search and correct your profile picture, name, and other personal information in 【 My 】 - 【 Personal Information 】."},{"content":"（2） Delete personal information"},{"content":"You can directly clear or delete some personal information on our product and/or service pages."},{"content":"In the following situations, you can request us to delete your personal information:"},{"content":"(1) The processing purpose has been achieved, cannot be achieved, or is no longer necessary to achieve the processing purpose;"},{"content":"(2) The personal information processor ceases to provide products or services, or the retention period has expired;"},{"content":"(3) Individual withdrawal of consent;"},{"content":"(4) Personal information processors violate laws, administrative regulations, or agreements by processing personal information;"},{"content":"(5) Other circumstances stipulated by laws and administrative regulations."},{"content":"You can contact us through the contact information provided in Article 10 of this Privacy Policy. We will review the issues as soon as possible and have a dedicated person verify your user identity before responding promptly. When you delete information from our service, we may not immediately delete the corresponding information from the backup system, but will delete this information when the backup is updated."},{"content":"（3） Manage and revoke your authorization and consent"},{"content":"You can contact us through the contact information provided in Article 10 of this Privacy Policy to request the management and revocation of your authorization and consent."},{"content":"Please understand that each business function requires some basic personal information to be completed. When you withdraw your consent or authorization, we cannot continue to provide you with the services corresponding to the withdrawal of consent or authorization, nor will we process your corresponding personal information. But your decision to withdraw consent or authorization will not affect the personal information processing previously carried out based on your authorization."},{"content":"（4） Cancel your account"},{"content":"You have the right to cancel your account registered in game products and/or services at any time. To ensure the safety of your account and property, you need to submit your account cancellation request to us through the application cancellation function or, in the absence of cancellation function, through customer service or the contact information specified in Article 10 of this privacy protection policy. We will respond to your request after verifying the relevant information with you."},{"content":"We would like to remind you that your account cancellation is an irreversible act. Once you cancel your account, we will delete or anonymize all information related to your account. We guarantee that this information will not be leaked, and at the same time, you cannot access game services through a cancelled account."},{"content":"（5） Complaints, Reports, and Responses"},{"content":"When you have any other complaints, suggestions, or related issues, please contact us through the email address specified in Article 10. We will review the issues as soon as possible and respond promptly after verifying your user identity."},{"content":"（6） Access Privacy Policy"},{"content":"We will inform you of this Privacy Policy when you first register for a game account and allow you to make your own decision to agree. In addition, you can log in to your personal account in the game product and view all the contents of this Privacy Policy at any time on the settings page."},{"content":"（7） Have the right to receive notification of cessation of operations"},{"content":"If we terminate the game service or operation, we will promptly cease the activity of collecting your personal information, and will notify you of the cessation of operation at least sixty days in advance in the form of individual delivery or announcement. After the termination of the service or operation, we will delete or anonymize the personal information we hold in accordance with laws and regulations."},{"content":"7、 Protection of Minors"},{"content":"We attach great importance to the protection of personal information of minors. If you are a minor under the age of 18, before using game related services, you should read and agree to this privacy protection policy under the supervision and guidance of your guardian, and use our services or provide information to us with the consent of your guardian. If you are a child under the age of 14, in order to protect their personal information, we have also released the 'Child Privacy Protection Policy'. Children and their guardians should carefully read the "Children's Privacy Protection Policy" before using game services. Only after obtaining the guardian's consent to the "Children's Privacy Protection Policy" can you use our services."},{"content":"For the collection of personal information of minors through the use of our products or services with the consent of parents or guardians, we will only use, share, transfer or disclose this information as permitted by laws and regulations, with the explicit consent of parents or guardians, or as necessary to protect minors. If we discover that personal information of minors has been collected without obtaining verifiable parental consent in advance, we will try to delete the relevant information as soon as possible."},{"content":"8、 How to update this privacy protection policy"},{"content":"（1） We may revise this privacy protection policy in a timely manner, and without your explicit consent, we will not reduce the rights you are entitled to under this privacy protection policy."},{"content":"（2） After the privacy protection policy is updated, we will display the updated privacy policy to you in the form of push notifications and pop ups when you log in and update the version, so that you can timely understand the latest version of this privacy policy. If you continue to use our services, you agree to accept the revised content of this privacy protection policy. However, if the updated content requires sensitive personal information such as address book, contact information, geographic location, etc., we will still seek your consent again in a significant way."},{"content":"（3） For significant changes, we will also provide more prominent notifications (including but not limited to SMS, private messages, special prompts on login pages, etc.) to explain the specific changes to this privacy protection policy. The significant changes referred to in this privacy protection policy include but are not limited to:"},{"content":"Our service model has undergone significant changes. Such as the purpose of processing personal information, the type of personal information processed, and the way in which personal information is used;"},{"content":"We have undergone significant changes in ownership structure, organizational structure, and other aspects. All changes caused by business adjustments, bankruptcy mergers and acquisitions, etc;"},{"content":"3. The main recipients of personal information sharing, transfer, or public disclosure have changed;"},{"content":"4. There have been significant changes in your right to participate in personal information processing and the way you exercise it;"},{"content":"When the responsible department, contact information, and complaint channels for handling personal information security change;"},{"content":"When the personal information security impact assessment report indicates the existence of high risks."},{"content":"9、 Scope of application"},{"content":"This privacy protection policy only applies to all services provided by Shifeng (Shenzhen) Network Technology Co., Ltd. and its affiliates, including game clients, websites, etc. It does not apply to third-party products or services that have separate privacy policies and are not included in this privacy protection policy."},{"content":"This privacy protection policy does not apply to game services linked to other third-party products or services. Your use of these third-party services (including any personal information you provide to these third parties) will be subject to the terms of service and privacy policies of these third parties (not this privacy protection policy). Please carefully read the terms of the third parties for specific provisions. Please protect your personal information properly and only provide it to third parties when necessary."},{"content":"10、 How to contact us"},{"content":"If you have any questions, opinions or suggestions regarding this privacy protection policy, you can send your questions to @."},{"content":"Our contact address:, contact information:."},{"content":"We will review the issues as soon as possible and respond promptly after verifying your user identity. Normally, we will respond to your request within 7 working days."},{"content":"If you are not satisfied with our response, especially if you believe that our personal information processing behavior has harmed your legitimate rights and interests, you can also seek a solution by filing a lawsuit with the court with jurisdiction over the defendant's domicile."},{"content":"Children's Privacy Protection Policy"},{"content":"This rule was updated on May 18th, 2023"},{"content":"This rule takes effect on May 18th, 2023"},{"content":"Special Reminder:"},{"content":"Shifeng (Shenzhen) Network Technology Co., Ltd. (hereinafter referred to as "we") is well aware of the importance of children's personal information to you as a guardian and the children under your guardianship (hereinafter referred to as "children"/"children"). In order to better protect children's personal information, in addition to the "Privacy Policy", we will also explain to you through the "Children's Privacy Policy" (referred to as "these rules") how our game collects, stores, protects, uses, and provides children's personal information to the outside world, and explain the rights enjoyed by you and the children you supervise."},{"content":"Any child participating in online activities should obtain the consent of their guardian in advance. If you are a child, please make sure to notify your guardian to read these rules together and seek their consent and guidance before using our products and services or submitting personal information."},{"content":"These rules are special rules formulated for children's personal information based on the Privacy Policy. In case of any inconsistency with the Privacy Policy, these rules shall prevail; If not specified in these rules, the Privacy Policy shall apply accordingly. In order to safeguard the legitimate rights and interests of children, as a guardian, we hope that you can actively educate and guide minors to enhance their awareness and ability to protect personal information, and protect the security of minors' personal information."},{"content":"The term 'child' referred to in these rules refers to minors under the age of fourteen."},{"content":"1、 How do we collect and use children's personal information"},{"content":"In the process of using the various business functions we provide to the children under your supervision, we may need to collect some information from you and the children in order to provide services to you and the children under your supervision and improve our service quality. This information may involve personal information of the children. In our Privacy Policy, we have explained the types and purposes of information that require your consent to be collected, as well as the consequences of refusing consent, in conjunction with specific services. In addition to the relevant provisions in the Privacy Policy, when you use our services related to children, we will collect information according to the following provisions in the services:"},{"content":"In the process of your child using game services, we will only collect personal information about your child that you agree to us collect or that you and your child voluntarily provide, in order to provide, optimize our services, and ensure the security of your child's account. For details of the personal information we may collect from your child, please refer to the Privacy Policy."},{"content":"To verify your guardianship relationship with your child, we may also collect your contact information (including phone number, email) and other information that helps us determine the guardianship relationship."},{"content":"We will not proactively obtain your child's personal information from third parties outside of affiliated companies. If in the future, for business development, it is necessary to indirectly obtain and process your child's personal information from third parties outside the game and its affiliated companies, we will strictly comply with relevant laws and regulations, require the third party to obtain your consent, and ensure the legality of the information provided."},{"content":"The services we provide related to children are constantly updated and developed. If you choose to use other services not covered by the Privacy Policy and these rules, based on which we need to collect children's personal information, we will explain the scope, purpose, and purpose of information collection separately through page prompts, interaction processes, and agreement agreements, and obtain your consent."},{"content":"2、 How do we store and protect children's personal information"},{"content":"1. We will follow the principles of legitimate necessity, informed consent, clear purpose, security protection, and lawful use, strictly comply with the requirements of laws and regulations such as the "Regulations on the Protection of Children's Personal Information Network" and the provisions of the "Privacy Protection Policy", and store children's information for no longer than the period necessary to achieve the purpose of information collection and use. After expiration, we will delete or anonymize children's personal information."},{"content":"2. We have designated a dedicated person to be responsible for the protection of children's information, strictly set information access permissions, adopt the principle of minimum sufficient authorization for staff who may come into contact with children's personal information, and take technical measures to record and control the handling of children's personal information by staff, in order to avoid illegal copying and downloading of children's personal information."},{"content":"3. We have developed an emergency plan for children's personal information security incidents and regularly organize internal personnel to receive emergency response training and drills, so that they can master their job responsibilities, emergency response strategies, and procedures. After the unfortunate occurrence of a personal information security incident involving children, we will promptly inform you of the basic situation and possible impact of the security incident, the disposal measures we have taken or will take, suggestions for you and related children to independently prevent and reduce risks, and remedial measures for you and related children in accordance with legal requirements. We will promptly inform you of the relevant situation of the event through APP push notifications or email notifications."},{"content":"4. After you and your child terminate the use of game services, we will cease to collect and use their personal information, except as otherwise provided by laws, regulations, or regulatory authorities. If we cease operations, we will promptly cease the collection of children's personal information, and notify the cessation of operations in the form of individual delivery or announcement, and delete the personal information held by the child."},{"content":"3、 How do we share, transfer, and disclose children's personal information"},{"content":"We promise to strictly keep children's personal information confidential, and only share, transfer, or disclose children's personal information in accordance with the Privacy Policy, these rules, and your explicit authorization and consent. We may share, transfer, or disclose children's personal information with you or third parties in the following situations:"},{"content":"1) Share with guardians. Guardians can access and manage the personal information of children under their guardianship."},{"content":"2) The sharing, transfer, and public disclosure situations stipulated in the "How We Share, Transfer, and Publicly Disclose Your Personal Information" section of the Privacy Policy. We will obtain the consent of the guardian in accordance with the requirements of laws, regulations, and national standards, or confirm that the information recipient has obtained the consent of the guardian."},{"content":"3) For the purposes stated in these rules, it is necessary to share children's personal information with third parties. We will evaluate the legality, legitimacy, and necessity of the third-party collection of children's personal information. We will require third parties to take protective measures for children's personal information and strictly comply with relevant laws, regulations, and regulatory requirements. In addition, we will obtain your consent in accordance with the requirements of laws, regulations, and national standards, or confirm that a third party has obtained your consent."},{"content":"4) We may entrust affiliated companies or other professional service agencies to handle children's information on our behalf. We will require the entrusted company to comply with strict confidentiality obligations and take effective confidentiality and security measures through written agreements, on-site audits, etc., prohibit them from using these children's personal information for purposes not authorized by the children and their guardians, and require the entrusted company to fulfill the following obligations in accordance with the law:"},{"content":"a) Process children's personal information in accordance with laws, administrative regulations, and our requirements;"},{"content":"b) Assist us in responding to applications from child guardians;"},{"content":"c) Take measures to ensure information security and provide timely feedback to us in the event of a child's personal information leakage security incident;"},{"content":"d) Timely delete children's personal information when the entrusted relationship is terminated;"},{"content":"e) No delegation is allowed;"},{"content":"f) Other obligations to protect children's personal information that should be fulfilled according to law."},{"content":"5) The personal information of children that you publicly disclose through the functions we provide, such as using our short video recording function to record videos with personal information of the ward and then publicly disclose them on our platform."},{"content":"4、 How do you access and manage children's personal information"},{"content":"During your use of the game service, in order to facilitate your access and management of information and protect your right to cancel your account, we have provided you with corresponding operation settings in the corresponding game client. You can follow the "Your Rights" guidelines in the "Privacy Policy" to operate. At the same time, you can also contact our customer service to request correction or deletion of children's personal information. Prior to this, we may need you to submit corresponding identification documents to verify your identity."},{"content":"In the following situations, you can contact our customer service to request the deletion of the corresponding child's personal information:"},{"content":"1) We collect, store, use, or provide children's personal information to the public in violation of laws, administrative regulations, or mutual agreements;"},{"content":"2) Collecting, storing, using, or providing children's personal information beyond the scope of the purpose or necessary period;"},{"content":"3) You withdrew your consent;"},{"content":"4) You or your child terminate the use of our products or services through cancellation or other means."},{"content":"5、 Application and update of these rules"},{"content":"In order to provide better services, we may update these rules in a timely manner. We will publish updated versions or prompt you for updated content on game websites and game product apps. We will notify you of updates related to children through website announcements or other appropriate means before it takes effect. Please also visit the game in a timely manner to stay informed of the latest rules."},{"content":"For significant changes, we will also provide you with more prominent notifications, such as explaining the specific changes to the rules through pop ups, private messages, or special prompts on your browsing page. In order for you to receive notifications in a timely manner, we suggest that you visit or update our products and services in a timely manner. The significant changes referred to in these rules include but are not limited to:"},{"content":"1) There have been significant changes in our ownership structure, organizational structure, and other aspects. Changes in ownership caused by business adjustments, bankruptcy mergers and acquisitions, etc;"},{"content":"2) The purpose, method, and scope of collecting, storing, using, and providing children's information to the public have undergone substantial changes;"},{"content":"3) Substantial changes have occurred in the location, duration, and processing of children's information storage after expiration;"},{"content":"4) The security measures for children's information have undergone substantial changes;"},{"content":"5) The consequences of refusing consent have undergone substantial changes;"},{"content":"6) The channels and methods for user complaints and reports have undergone substantial changes;"},{"content":"7) The ways and methods of correcting and deleting children's information have undergone substantial changes;"},{"content":"8) Other changes that may have a significant impact on children's information rights."},{"content":"If a child or you continue to use our products or services after the update of these rules takes effect, it means that the child and you have fully read, understood, and accepted the updated rules and are willing to be bound by them."},{"content":"6、 How to contact us"},{"content":"We have dedicated personnel responsible for protecting children's information. If you and your child have any questions about this policy, or have any complaints or opinions about the processing of children's personal information, please contact us through the following channels. We will respond to your request within 7 working days after receiving any questions, opinions or suggestions. To ensure the security of children's information, we need to verify your and/or your child's identity first."},{"content":"Customer service hotline;"},{"content":"2. You can contact us through the game's online customer service;"},{"content":"3. You can also use a dedicated email for personal information protection lukaichun@gdsftoys.com Contact Us"},{"content":"Our contact address is Room 902, Building 8, Qianhai Excellence Financial Center (Phase I), Unit 2, Guiwan Area, Nanshan Street, Qianhai Shenzhen Hong Kong Cooperation Zone, Shenzhen"}]}]],0,0,[],[],[]]